[M_Nast_Easter MissionDefinition]
MissionName="Good day and weapon"
MissionDescription="Mr. Merlock, you have been arrested [place]Wham Bam Island[-place] Have fun at the weekend. Download and start the party!!"
TurnInDescription="Thank you very much!"
MissionSummary="Find Mr. Hammerlock."
MissionGiver="Mr. Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText="Who wants a beach party??"

[M_Nast_Easter:04_FirstFindHammerlock MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:05_LookForToilet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Lord Hammerlock is calling. [place]Wanbim Island[-place] Have a great weekend! Unfortunately, the beast stole half a second after meeting him. First you need to find a way to get it.."

[M_Nast_Easter:100_FollowVarkid MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Mr. Hammerlock is calling you [place]Bam from hot islands[-place] I wish you a good week. Unfortunately, half a second after seeing him, he is kidnapped by the creature..<br>Mordecai discovers a way to find out: attach the center of the hammer to another warchild and it will remove you..<br>After another warrior turns into a hunter, you must track him down and rescue Hammer.."

[M_Nast_Easter:105_HammerlockWaypoint MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:10_FindHammerlockSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:110_SummonBoss MissionObjectiveSetDefinition]
MissionSummaryOverride="Call the son of Bookerox."
MissionDescriptionOverride="For you, that name is Mr. Hammerlock. [place]Bangban Island[-place] Have a nice weekend. Unfortunately, seconds after it was found, it was stolen by a monster..<br>It turns out that Hammerlock is kidnapped by an evil monster named Son of Bucherax. You must summon and kill this monster before the hammer is released.."

[M_Nast_Easter:120_FightBoss MissionObjectiveSetDefinition]
MissionSummaryOverride="Kill Buharx's son."
MissionDescriptionOverride=""

[M_Nast_Easter:130_RescueHammerlock MissionObjectiveSetDefinition]
MissionSummaryOverride="Save Lord Hammerlock."
MissionDescriptionOverride="Lord Hammerlock has summoned you. [place]bamwang island[-place] have a nice weekend. Unfortunately, half a second into the encounter, he is captured by a creature..<br>Hammerlock was kidnapped by an evil demon named the Son of Buclax. <br>But you killed this creature to save Lord Hammerlock."

[M_Nast_Easter:140_DelayTurnIn MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:15_LookForNeedle MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:20_LookForScentSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Please call Mr. hammer."
MissionDescriptionOverride="Mr. Hammerlock called you. [place]Bangban Island[-place] happy easter! Unfortunately, half a second after meeting him, he was captured by the creature. First you have to find a way to find it.."

[M_Nast_Easter:30_FindVarkidEggSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Hammer odor in children of prisoners of war."
MissionDescriptionOverride="Sir Hammerlock had summoned him. [place]Wimbam Island[-place] Hope you have a great weekend. But when the game is over The beast then stole the second half..<br>Mordecai looked for a way to find him. Just throw the Hammerlock head into the cockpit. And it will take you there.."

[M_Nast_Easter:40_InjectEggSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:50_FollowVarkidSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Lord Hammerlock has summoned you. [place]bangban island[-place] Hope you have a good weekend. Unfortunately, half a second after they meet, they are kidnapped by another creature..<br>Mordecai is looking for a way to find him. Spray the scent of the hammer onto Valkader's skin and it will lead you to him..<br>I brought the smell of the hammer to the castle. Just press the button."

[M_Nast_Easter:52_KillVarkidSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:54_FindVarkidEggSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Mr. Murlock called you. [place]Left bomb island[-place] Enjoy your weekend! Unfortunately, after half a minute of meeting, the Beast woke up..<br>Mordecai found a way. Just put the mallet and hammer in the crate and it will take you there.."

[M_Nast_Easter:56_InjectVarkidEggSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:58_FollowVarkidSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Lord Hammerlock invites you. [place]My Bam Island[-place] Have a great week! Unfortunately, the animal was kidnapped in the second half after they met..<br>Mordecai found a way to find him. He touched the lock of her thigh to her..<br>You put hemlock oil in your body. Check out Vercode now.."

[M_Nast_Easter:60_FindPathtoIsland MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Mr. Hammerlock called you. [place]Bama Island[-place] Enjoy your weekend. Unfortunately, within half a second of finding it, an animal steals it..<br>Mordecai found a way to find it: he smelled a hammer key in the room, and brought him to him..<br>The chariot you are chasing is going down the tunnel. You have to find a way to get the flow back into the tunnel and into the locker room.."

[M_Nast_Easter:65_KillThreshers MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="seed. Take back your complaints [place]Left wing bomb island[-place] Good luck. Unfortunately, less than 0.5 seconds after meeting him, he was kidnapped by another creature..<br>Mordecai found a way to find him. Applying Hammerlock's scent to Warkid's cocoon will take you to it..<br>The warrior you are looking for has disappeared in the distance. If you want to continue tracking Workid, you need to find a way to restore the contents of the path..<br>But now you have to kill the bandits.."

[M_Nast_Easter:69_StartWheelPre MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:70_StartWheel MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Hammerlock is calling you! [place]Nusai Wambam[-place] This is the only way to enjoy this weekend. Unfortunately, half a second after the encounter, the animal killed him..<br>Mordecai found a way to find him: he hit Wajid's bladder with a hammer and brought a dog..<br>Wajid entered the hole, they chased him and disappeared. You must find a way to regain control of the cave in order to continue your quest for Warki..<br>The ant explains that if you turn on the water motor, the contents of the hole will return to normal.."

[M_Nast_Easter:71_StartWheelPt2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:72_StartWheelPt3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:80_FollowVarkid2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Morlock summons you [place]Wham Bam Island[-place] I wish you a peaceful week. Unfortunately, half a second after the encounter, the creature kidnaps her..<br>Mordecai found a way to find him: spray Verkit's house with the smell of hammer and he will take you to him..<br>You have met the person you are looking for. Keep going and he'll take you to the Hammer."

[M_Nast_Easter:84_FollowVarkid2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:85_KeepFollowingVarkid MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hammerlock has summoned you [place]Wham left island[-place] Enjoy your weekend! Unfortunately, half a second after meeting him, he is kidnapped by a creature..<br>Mordecai finds a way to find him: he sends the smell of a hammer into another battle pit that will lead him there..<br>Have the workbook you are looking for. Continue on and you'll reach the Hammer Lock."

[M_Nast_Easter:88_FollowVarkid2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:90_FindAnotherEgg MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hamerlock is on the phone. [place]Wanban Island[-place] Have a nice weekend. Unfortunately, half a second after the encounter, the criminal caught him..<br>Mordecai has found a way to find him: just inject Hammerlock's scent into one of Varkid's pods and it will lead you to him.."

[M_Nast_Easter:92_FindAnotherEgg MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:94_FindAnotherEgg MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:95_InjectBigEgg MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Nast_Easter:FindEgg MissionObjectiveDefinition]
ProgressMessage="Go to Varkids"

[M_Nast_Easter:FindEgg2 MissionObjectiveDefinition]
ProgressMessage="Find a job"

[M_Nast_Easter:FindHammerlock MissionObjectiveDefinition]
ProgressMessage="Find the page. Hammer lock"

[M_Nast_Easter:FindLedge MissionObjectiveDefinition]
ProgressMessage="Find the best places"

[M_Nast_Easter:FindPathtoIsland MissionObjectiveDefinition]
ProgressMessage="Find a way to the island"

[M_Nast_Easter:FollowVarkid MissionObjectiveDefinition]
ProgressMessage="Follow Barkid"

[M_Nast_Easter:FollowVarkid2 MissionObjectiveDefinition]
ProgressMessage="Meeting Valkyd"

[M_Nast_Easter:FollowVarkid2Pt2 MissionObjectiveDefinition]
ProgressMessage="Follow Varkid's wings"

[M_Nast_Easter:InjectBigEgg MissionObjectiveDefinition]
ProgressMessage="Farcade prices are widely spread."

[M_Nast_Easter:InjectEgg MissionObjectiveDefinition]
ProgressMessage="Enter the Varcid capsule"

[M_Nast_Easter:KillBoss MissionObjectiveDefinition]
ProgressMessage="Defeat the son of Bakturk"

[M_Nast_Easter:KillThreshers MissionObjectiveDefinition]
ProgressMessage="Kill the bandits"

[M_Nast_Easter:KillVarkid MissionObjectiveDefinition]
ProgressMessage="The soldiers were killed"

[M_Nast_Easter:LookForNeedle MissionObjectiveDefinition]
ProgressMessage="Find a coconut injection that works"

[M_Nast_Easter:LookForScent MissionObjectiveDefinition]
ProgressMessage="Take Sir Hammerlock's whiskey"

[M_Nast_Easter:RescueHammerlock MissionObjectiveDefinition]
ProgressMessage="The server is on Malelock."

[M_Nast_Easter:RestoreTubePower MissionObjectiveDefinition]
ProgressMessage="Turn on the water wheel."

[M_Nast_Easter:SummonBoss MissionObjectiveDefinition]
ProgressMessage="He is said to be the son of Bukerax."

[M_Nast_Easter:TalkToHammerlock MissionObjectiveDefinition]
ProgressMessage="Talk to Sir Hammerlock"

